 # 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных
# каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
# а указать явно, в программе.

l1 = [2, 3.3, 'Hello', None, 100]

for x in l1:
    print(x, type(x))