# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима,
# весна, лето, осень). Напишите решения через list и через dict.

try:
    month = int(input("Введите номер месяца: "))

    months = [["январь", "Зима"], ["февраль", "Зима"], ["март", "Весна"], ["апрель", "Весна"],
             ["май", "Весна"], ["июнь", "Лето"], ["июль", "Лето"], ["август", "Лето"],
             ["сентябрь", "Осень"], ["октябрь", "Осень"], ["ноябрь", "Осень"], ["декабрь", "Зима"]]

    print(months[month - 1][0], "-", months[month - 1][1].lower())

    months_dict = {1: ["январь", "Зима"]
                    ,2: ["февраль", "Зима"]
                    ,3: ["март", "Весна"]
                    ,4: ["апрель", "Весна"]
                    ,5: ["май", "Весна"]
                    ,6: ["июнь", "Лето"]
                    ,7: ["июль", "Лето"]
                    ,8: ["август", "Лето"]
                    ,9: ["сентябрь", "Осень"]
                    ,10: ["октябрь", "Осень"]
                    ,11: ["ноябрь", "Осень"]
                    ,12: ["декабрь", "Зима"]}

    print(months_dict[month][0], "-", months_dict[month][1].lower())
except IndexError as err:
    print("Значение вне диапозона", err)